#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.stripe_product.vst["cool-synth-v1"]: Refreshing state... [id=prod_U1SInllK5crk4M]
module.backend.stripe_product.vst["retro-verb-v1"]: Refreshing state... [id=prod_U1SIEvbdLWIMKe]
module.backend.local_file.vst_config: Refreshing state... [id=42fbeba9537df670e6681404d6e34fb6893634c0]
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.my_purchases_zip: Reading...
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=89858a795770ef58dc4c479873987033749c1728]
module.backend.data.archive_file.my_purchases_zip: Read complete after 0s [id=cdb72f57c6a904c8cfb8062b50e33356f1239e55]
module.backend.stripe_price.vst_price["retro-verb-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnBSi6RYWa]
module.backend.stripe_price.vst_price["cool-synth-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnZfnovW9O]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 0s [id=15f2923314c5bb387fbef7c6e5615efa7a8c1bfc]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:22]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=hghcjv]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-g6jnm33pu7-DEFAULT_4XX]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=e02sjc]
module.backend.aws_api_gateway_resource.my_purchases: Refreshing state... [id=pqx6tn]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=uilktp]
module.backend.module.my_purchases_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-pqx6tn-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-g6jnm33pu7-uilktp-POST]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.my_purchases_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-pqx6tn-OPTIONS-200]
module.backend.module.my_purchases_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-pqx6tn-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-GET]
module.backend.aws_api_gateway_method.my_purchases_get: Refreshing state... [id=agm-g6jnm33pu7-pqx6tn-GET]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-POST]
module.backend.aws_lambda_function.my_purchases: Refreshing state... [id=vstshop-my-purchases-dev]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-dev]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.my_purchases_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-pqx6tn-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-dev]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_lambda_permission.api_gw_my_purchases: Refreshing state... [id=AllowExecutionFromAPIGatewayPurchases]
module.backend.aws_api_gateway_integration.my_purchases_int: Refreshing state... [id=agi-g6jnm33pu7-pqx6tn-GET]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-g6jnm33pu7-uilktp-POST]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-dev]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-GET]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=oaiyk5]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=9ebf127f4251f8d1098d9b223024616c10c89532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_V9hhjw2Y5
            VITE_USER_POOL_CLIENT_ID=2p1utd8g6jkts9qp59n7b5k9le
            VITE_API_URL=https://g6jnm33pu7.execute-api.us-east-2.amazonaws.com/dev
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-g6jnm33pu7-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:22",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "STRIPE_PRODUCT_MAP"    = jsonencode(
                  ~ {
                      - retro-verb-v1 = "price_1T3PNzDyEyPnHPBnBSi6RYWa"
                        # (1 unchanged attribute hidden)
                    }
                )
                # (3 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.download will be updated in-place
  ~ resource "aws_lambda_function" "download" {
        id                             = "vstshop-download-dev"
        tags                           = {}
        # (32 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "S3_KEY_MAP"     = jsonencode(
                  ~ {
                      - retro-verb-v1 = "vsts/retro-verb.zip"
                        # (1 unchanged attribute hidden)
                    }
                )
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:22",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:22" -> (known after apply)
      ~ code_sha256                 = "Fv7r2LhwLSvy1UM0yjo9xm/+L0t6PtiCtyTpnjIZmkg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-22T02:08:40.557+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:22" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Fv7r2LhwLSvy1UM0yjo9xm/+L0t6PtiCtyTpnjIZmkg=" -> "KUDPdkDbuWX+KFyzbPCL7cFQ0lAjOvCV+P88zK+bW9M=" # forces replacement
      ~ source_code_size            = 4678026 -> (known after apply)
      ~ version                     = "22" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.local_file.vst_config will be created
  + resource "local_file" "vst_config" {
      + content              = jsonencode(
            [
              + {
                  + id    = "cool-synth-v1"
                  + name  = "Cool Synth VST"
                  + price = "$29.99"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

  # module.backend.stripe_price.vst_price["retro-verb-v1"] will be destroyed
  # (because key ["retro-verb-v1"] is not in for_each map)
  - resource "stripe_price" "vst_price" {
      - active         = true -> null
      - billing_scheme = "per_unit" -> null
      - currency       = "usd" -> null
      - id             = "price_1T3PNzDyEyPnHPBnBSi6RYWa" -> null
      - metadata       = {} -> null
      - product        = "prod_U1SIEvbdLWIMKe" -> null
      - tax_behavior   = "unspecified" -> null
      - unit_amount    = 1999 -> null
        # (3 unchanged attributes hidden)
    }

  # module.backend.stripe_product.vst["retro-verb-v1"] will be destroyed
  # (because key ["retro-verb-v1"] is not in for_each map)
  - resource "stripe_product" "vst" {
      - active               = true -> null
      - id                   = "prod_U1SIEvbdLWIMKe" -> null
      - metadata             = {} -> null
      - name                 = "Retro Verb VST" -> null
      - shippable            = false -> null
      - type                 = "service" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>